Repository: LaiWenKang/MoneyUp
Catalog: App/MoneyUp/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# fx.error.conversion_underflow
source: This non-zero conversion is smaller than the destination currency can represent.
zh_hans: 此非零换算结果小于目标币种可表示的最小金额。

# fx.error.invalid_date
source: This effective date is invalid or does not match its reporting time zone.
zh_hans: 此生效日期无效，或与其报告时区不一致。

# fx.error.invalid_rate
source: Enter an exchange rate greater than zero.
zh_hans: 请输入大于零的汇率。

# fx.estimate_accessibility_hint
source: Fills the received amount using your latest applicable historical rate; review it before saving.
zh_hans: 使用最近适用的历史汇率填入到账金额；保存前请检查。

# fx.estimated_detail
source: Conversions are visibly marked as estimates. MoneyUp never downloads or assumes a market rate.
zh_hans: 换算结果会明确标注为估算值。MoneyUp 不会下载或臆测市场汇率。

# fx.net_worth_estimated
source: Includes user-rate estimates
zh_hans: 包含用户汇率估算

# fx.net_worth_complete_rate_needed
source: Currencies stay separate until every non-zero foreign balance has an applicable dated rate.
zh_hans: 在每个非零外币余额都有适用的日期汇率之前，各币种会保持分开。

# fx.rates_as_of
source: rates as of
zh_hans: 汇率日期

# fx.snapshot_conversion_evidence
source: Frozen conversion evidence
zh_hans: 已冻结的换算依据

# fx.snapshot_rate_day_format
source: Rate day %lld · %@
zh_hans: 汇率日 %lld · %@

# fx.snapshot_direct
source: direct
zh_hans: 直接汇率

# fx.snapshot_inverse
source: inverse
zh_hans: 反向汇率

# fx.net_worth_unconverted_format
source: Unconverted foreign balances: %lld
zh_hans: 仍有 %lld 个外币余额未换算

# fx.no_rates
source: No saved rates
zh_hans: 没有已保存汇率

# fx.quote_currency
source: Quote currency
zh_hans: 计价币种

# fx.quote_per_base
source: Quote units per 1 base unit
zh_hans: 每 1 基准币的计价币数量

# fx.rate_detail
source: Enter the dated rate you actually used or trust. A later rate never changes an earlier transaction.
zh_hans: 请输入你实际使用或信任的日期汇率。之后添加的汇率不会改变较早的交易。

# fx.save_rate
source: Save rate
zh_hans: 保存汇率

# fx.saved_rates
source: Saved rates
zh_hans: 已保存汇率

# fx.title
source: Exchange rates
zh_hans: 汇率

# fx.unconverted_detail
source: Without an applicable rate, foreign amounts remain separate and unconverted.
zh_hans: 没有适用汇率时，外币金额会保持独立且不换算。

# fx.unconverted_mode
source: No applicable rate · keep unconverted
zh_hans: 没有适用汇率 · 保持不换算

# fx.use_estimate_format
source: Use estimated %@ %@ · rate day %lld
zh_hans: 使用估算 %@ %@ · 汇率日 %lld

# import.apply_mapping
source: Apply column mapping
zh_hans: 应用栏位映射

# import.column_mapping
source: Column mapping
zh_hans: 栏位映射

# import.column_mapping_detail
source: Review every detected column. Date and one amount, outflow, or inflow column are required.
zh_hans: 请检查每个栏位。日期，以及金额、支出或收入栏位中的至少一个为必填。

# import.column_none
source: Not present
zh_hans: 不存在

# import.field.account
source: Account
zh_hans: 账户

# import.field.amount
source: Amount
zh_hans: 金额

# import.field.category
source: Category
zh_hans: 分类

# import.field.currency
source: Currency
zh_hans: 币种

# import.field.date
source: Date and time
zh_hans: 日期与时间

# import.field.destinationAccount
source: Destination account
zh_hans: 目标账户

# import.field.destinationAmount
source: Destination amount
zh_hans: 到账金额

# import.field.id
source: Source transaction ID
zh_hans: 来源交易 ID

# import.field.inflow
source: Inflow
zh_hans: 收入金额

# import.field.kind
source: Transaction type
zh_hans: 交易类型

# import.field.note
source: Note
zh_hans: 备注

# import.field.outflow
source: Outflow
zh_hans: 支出金额

# import.field.payee
source: Payee or merchant
zh_hans: 收款方或商户

# import.raw_preview
source: Raw source preview
zh_hans: 原始数据预览

# import.review_mappings
source: Review account and category mapping
zh_hans: 检查账户与分类映射

# import.review_mappings_detail
source: Every source name shown here will post to the MoneyUp item you approve.
zh_hans: 这里显示的每个来源名称都会记入你确认的 MoneyUp 项目。

# quick_log.keep_receipt
source: Keep this receipt with the transaction
zh_hans: 将此收据保留在交易中

# quick_log.keep_receipt_detail
source: Off by default. If enabled, MoneyUp removes location and camera metadata, then saves a bounded copy only after you save, inside the encrypted database and encrypted backups.
zh_hans: 默认关闭。启用后，MoneyUp 会移除位置与相机元数据，并仅在你保存交易后，将受限大小的副本写入加密数据库与加密备份。

# quick_log.keep_receipt_hint
source: The original photo is used transiently for on-device recognition; it is never stored in an unfinished draft or widget.
zh_hans: 原始照片仅临时用于设备端识别，不会写入未完成草稿或小组件。

# quick_log.split_add
source: Add split
zh_hans: 添加拆分

# quick_log.split_amount
source: Split amount
zh_hans: 拆分金额

# quick_log.split_amount_numbered
source: Split %d amount
zh_hans: 第 %d 条拆分金额

# quick_log.split_balanced
source: The split balances exactly and can be saved.
zh_hans: 拆分已精确平衡，可以保存。

# quick_log.split_category
source: Split category
zh_hans: 拆分分类

# quick_log.split_category_numbered
source: Split %d category
zh_hans: 第 %d 条拆分分类

# quick_log.split_memo
source: Split note (optional)
zh_hans: 拆分备注（可选）

# quick_log.split_memo_numbered
source: Split %d note (optional)
zh_hans: 第 %d 条拆分备注（可选）

# quick_log.split_not_balanced
source: Allocate the exact remaining amount before saving.
zh_hans: 保存前请精确分配剩余金额。

# quick_log.split_remainder
source: Remaining
zh_hans: 剩余

# quick_log.split_remove
source: Remove split
zh_hans: 移除拆分

# quick_log.split_remove_numbered
source: Remove split %d
zh_hans: 移除第 %d 条拆分

# quick_log.split_transaction
source: Split across categories
zh_hans: 拆分至多个分类

# receipt.attachment_encrypted_detail
source: Stored only in MoneyUp's encrypted database and encrypted portable backups.
zh_hans: 仅存储在 MoneyUp 的加密数据库与加密便携备份中。

# receipt.attachment_image
source: Saved receipt image
zh_hans: 已保存的收据图片

source: Receipt attachments
zh_hans: 收据附件

# receipt.delete_attachment
source: Delete receipt image
zh_hans: 删除收据图片

# receipt.delete_attachment_hint
source: Asks for confirmation before permanently deleting this encrypted image.
zh_hans: 永久删除此加密图片前会要求确认。

# receipt.delete_detail
source: This encrypted receipt image will be permanently deleted. This cannot be undone.
zh_hans: 此加密收据图片将被永久删除，且无法撤销。

# receipt.delete_title
source: Delete encrypted receipt image?
zh_hans: 删除加密收据图片？

# receipt.error.empty
source: The selected receipt image is empty.
zh_hans: 所选收据图片为空。

# receipt.error.too_large
source: This image is too large to keep safely. Choose an image under 15 MB.
zh_hans: 此图片过大，无法安全保存。请选择小于 15 MB 的图片。

# split.error.balance
source: Split amounts must equal the transaction total exactly.
zh_hans: 拆分金额必须与交易总额完全一致。

# split.error.currency
source: Every split must use the transaction currency.
zh_hans: 每个拆分必须使用交易币种。

# split.error.positive
source: Every split amount must be greater than zero.
zh_hans: 每个拆分金额必须大于零。

# split.error.too_few
source: Add at least two split lines.
zh_hans: 请至少添加两条拆分。

# error.calculation_unavailable
source: This value is temporarily unavailable.
zh_hans: 此数值暂时无法计算。

# goal.active
source: Active goals
zh_hans: 进行中的目标

# goal.add
source: Add goal
zh_hans: 添加目标

# goal.archived
source: Archived
zh_hans: 已归档

# goal.balance
source: Current progress
zh_hans: 当前进度

# goal.complete
source: Complete
zh_hans: 已完成

# goal.contribute
source: Add contribution
zh_hans: 添加存入

# goal.contributed
source: Contributed
zh_hans: 累计存入

# goal.currency
source: Currency
zh_hans: 币种

# goal.delete_detail
source: This permanently deletes the goal, contributions, withdrawals, and reset history. Ledger transactions are unchanged.
zh_hans: 这会永久删除目标、存入、取出及重置记录，但不会更改账本交易。

# goal.delete_title
source: Delete this goal?
zh_hans: 删除此目标？

# goal.empty
source: Turn plans into progress
zh_hans: 把计划变成可见进度

# goal.empty_detail
source: Create a savings goal or sinking fund, then record each contribution and withdrawal.
zh_hans: 创建储蓄目标或备用金，并记录每次存入与取出。

# goal.error.invalid
source: Check the name, positive target, date, currency, and reset rule.
zh_hans: 请检查名称、正数目标、日期、币种与重置规则。

# goal.error.withdrawal_exceeds_balance
source: The withdrawal cannot exceed this goal's current progress.
zh_hans: 取出金额不能超过此目标的当前进度。

# goal.identity
source: Goal details
zh_hans: 目标详情

# goal.in_progress
source: In progress
zh_hans: 进行中

# goal.kind
source: Type
zh_hans: 类型

# goal.kind.savings
source: Savings goal
zh_hans: 储蓄目标

# goal.kind.sinking
source: Sinking fund
zh_hans: 专项备用金

# goal.manage
source: Manage goal
zh_hans: 管理目标

# goal.manage_hint
source: Opens goal details, movements, reset, and archive actions.
zh_hans: 打开目标详情、存取记录、重置与归档操作。

# goal.movement_amount
source: Amount
zh_hans: 金额

# goal.movement_date
source: Date
zh_hans: 日期

# goal.movements
source: Contributions and withdrawals
zh_hans: 存入与取出

# goal.movements_detail
source: These are encrypted planning records. They do not create or alter ledger transactions.
zh_hans: 这些是加密的规划记录，不会创建或更改账本交易。

# goal.name
source: Name
zh_hans: 名称

# goal.overdue
source: Past target date
zh_hans: 已超过目标日期

# goal.progress
source: Progress
zh_hans: 进度

# goal.remaining
source: Remaining
zh_hans: 尚需

# goal.reset.monthly
source: Start fresh each month
zh_hans: 每月重新开始

# goal.reset.never
source: Keep until I reset
zh_hans: 保留至手动重置

# goal.reset.yearly
source: Start fresh each year
zh_hans: 每年重新开始

# goal.reset_detail
source: Progress returns to zero now. The dated contribution and withdrawal history remains encrypted for audit.
zh_hans: 进度会立即归零；带日期的存入与取出历史仍会加密保留，以便核对。

# goal.reset_now
source: Reset progress now
zh_hans: 立即重置进度

# goal.reset_rule
source: Reset behavior
zh_hans: 重置方式

# goal.reset_rule_detail
source: Monthly and yearly rules reset displayed progress at a Gregorian reporting boundary; history is retained.
zh_hans: 按月或按年会在公历报表边界重置显示进度，历史记录仍会保留。

# goal.reset_title
source: Reset this goal's progress?
zh_hans: 重置此目标进度？

# goal.target
source: Target
zh_hans: 目标

# goal.target_amount
source: Target amount
zh_hans: 目标金额

# goal.target_date
source: Target date
zh_hans: 目标日期

# goal.withdraw
source: Record withdrawal
zh_hans: 记录取出

# goal.withdrawn
source: Withdrawn
zh_hans: 累计取出

# plan.goals
source: Goals
zh_hans: 目标

# plan.rollover
source: Carry forward
zh_hans: 结转规则

# plan.rollover.full_balance
source: Full signed balance
zh_hans: 结转完整正负余额

# plan.rollover.none
source: No carry-forward
zh_hans: 不结转

# plan.rollover.positive_only
source: Unused amount only
zh_hans: 仅结转未用金额

# plan.rollover_detail
source: No carry-forward resets to the configured limit. Unused amount only carries a positive remainder. Full signed balance also carries overspending into the next Gregorian month. Enabling starts this month; earlier history is not backfilled.
zh_hans: “不结转”每月恢复设定上限；“仅结转未用金额”只带入正数余款；“结转完整正负余额”也会把超支带到下个公历月。启用后从本月开始，不回溯旧月份。

# settings.reporting_time_zone
source: Reporting time zone
zh_hans: 报表时区

# settings.widget.budget_status
source: Allow budget percentage widget
zh_hans: 允许预算百分比小组件

# settings.widget.budget_status_detail
source: Off by default. When enabled, MoneyUp shares only a rounded percent used with the widget—never an amount, payee, account, holding, or balance. Choose Budget status while editing the widget.
zh_hans: 默认关闭。启用后，MoneyUp 只会向小组件共享取整后的已用百分比，绝不共享金额、商户、账户、持仓或余额。编辑小组件时请选择“预算状态”。

# settings.widget.budget_status_hint
source: Controls whether the widget may read a percentage-only budget snapshot.
zh_hans: 控制小组件是否可以读取仅含百分比的预算快照。

# settings.widgets_and_reports
source: Widgets and reporting
zh_hans: 小组件与报表
